Revit 2027 API
ViewSystemsAnalysisReport.WeatherFile Property
 The full path name of the weather file used for the systems analysis.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string WeatherFile { get; }
Public ReadOnly Property WeatherFile As String
	Get
public:
property String^ WeatherFile {
	String^ get ();
}
member WeatherFile : string with get
Property Value
String
See Also
Reference
ViewSystemsAnalysisReport Class
Autodesk.Revit.DB.Analysis Namespace